<?php

return array (
  'accepted' => 'يجب قبول السمة:.',
  'active_url' => 'السمة: ليست عنوان URL صالحًا.',
  'after' => 'يجب أن تكون السمة تاريخًا بعد: التاريخ.',
  'after_or_equal' => 'يجب أن تكون السمة تاريخًا بعد: التاريخ أو مساويًا له.',
  'alpha' => 'لا يجوز أن تحتوي السمة: إلا على أحرف.',
  'alpha_dash' => 'لا يجوز أن تحتوي السمة: إلا على أحرف وأرقام وشرطات وشرطات سفلية.',
  'alpha_num' => 'لا يجوز أن تحتوي السمة: إلا على أحرف وأرقام.',
  'array' => 'يجب أن تكون السمة مصفوفة.',
  'attributes' =>
  array (
  ),
  'before' => 'يجب أن تكون السمة تاريخًا قبل: التاريخ.',
  'before_or_equal' => 'يجب أن تكون السمة تاريخًا يسبق: التاريخ أو مساويًا له.',
  'between' =>
  array (
    'array' => 'يجب أن تحتوي السمة: على ما بين: اقل و: اكثر من العناصر.',
    'file' => 'يجب أن تكون السمة: بين: اقل و: اكثر كيلوبايت.',
    'numeric' => 'يجب أن تكون السمة: بين: اقل  و: اكثر .',
    'string' => 'يجب أن تكون السمة: بين: اقل و: اكثر حرفًا.',
  ),
  'boolean' => 'يجب أن يكون حقل السمة: صح أو خطأ.',
  'confirmed' => 'تأكيد السمة غير متطابق.',
  'custom' =>
  array (
    'attribute-name' =>
    array (
      'rule-name' => 'رسالة مخصصة',
    ),
  ),
  'date' => 'السمة: ليست تاريخًا صالحًا.',
  'date_equals' => 'يجب أن تكون السمة تاريخًا مساويًا لـ: التاريخ.',
  'date_format' => 'السمة: لا تطابق التنسيق: صيغة.',
  'different' => 'يجب أن يكون: السمة و: الآخر مختلفين.',
  'digits' => 'يجب أن تكون السمة: أرقامًا وأرقامًا.',
  'digits_between' => 'يجب أن تكون السمة: بين: اقل و: اكثر أرقام.',
  'dimensions' => 'السمة لها أبعاد صورة غير صالحة.',
  'distinct' => 'يحتوي حقل السمة على قيمة مكررة.',
  'email' => 'يجب أن تكون السمة عنوان بريد إلكتروني صالحًا.',
  'ends_with' => 'يجب أن تنتهي السمة: بأحد القيم التالية:',
  'exists' => 'السمة المحددة: غير صالحة.',
  'file' => 'يجب أن تكون السمة: ملفًا.',
  'filled' => 'يجب أن يحتوي حقل السمة على قيمة.',
  'gt' =>
  array (
    'array' => 'يجب أن تحتوي السمة: على أكثر من: عناصر القيمة.',
    'file' => 'يجب أن تكون السمة: أكبر من: القيمة كيلوبايت.',
    'numeric' => 'يجب أن تكون السمة: أكبر من: القيمة.',
    'string' => 'يجب أن تكون السمة: أكبر من: أحرف القيمة.',
  ),
  'gte' =>
  array (
    'array' => 'يجب أن تحتوي السمة: على عناصر قيمة أو أكثر.',
    'file' => 'يجب أن تكون السمة: أكبر من أو تساوي: القيمة كيلوبايت.',
    'numeric' => 'يجب أن تكون السمة: أكبر من أو تساوي: القيمة.',
    'string' => 'يجب أن تكون السمة: أكبر من أو تساوي: أحرف القيمة.',
  ),
  'image' => 'يجب أن تكون السمة صورة.',
  'in' => 'السمة المحددة: غير صالحة.',
  'in_array' => 'حقل السمة: غير موجود في: أخرى.',
  'integer' => 'يجب أن تكون السمة عددًا صحيحًا.',
  'ip' => 'يجب أن تكون السمة: عنوان IP صالحًا.',
  'ipv4' => 'يجب أن تكون السمة: عنوان IPv4 صالحًا.',
  'ipv6' => 'يجب أن تكون السمة عنوان IPv6 صالحًا.',
  'json' => 'يجب أن تكون السمة: سلسلة JSON صالحة.',
  'lt' =>
  array (
    'array' => 'يجب أن تحتوي السمة على أقل من: عناصر القيمة.',
    'file' => 'يجب أن تكون السمة: أقل من: قيمة كيلوبايت.',
    'numeric' => 'يجب أن تكون السمة: أقل من: القيمة.',
    'string' => 'يجب أن تكون السمة: أقل من: أحرف القيمة.',
  ),
  'lte' =>
  array (
    'array' => 'يجب ألا تحتوي السمة: على أكثر من: عناصر القيمة.',
    'file' => 'يجب أن تكون السمة: أقل من أو تساوي: قيمة كيلوبايت.',
    'numeric' => 'يجب أن تكون السمة: أقل من أو تساوي: القيمة.',
    'string' => 'يجب أن تكون السمة: أقل من أو تساوي: أحرف القيمة.',
  ),
  'max' =>
  array (
    'array' => 'لا يجوز أن تحتوي السمة: على أكثر من: الحد الأقصى من العناصر.',
    'file' => 'لا يجوز أن تكون السمة: أكبر من: اكثر كيلوبايت.',
    'numeric' => 'لا يجوز أن تكون السمة: أكبر من: اكثر.',
    'string' => 'لا يجوز أن تكون السمة: أكبر من: الحد الأقصى من الأحرف.',
  ),
  'mimes' => 'يجب أن تكون السمة: ملفًا من النوع: القيم.',
  'mimetypes' => 'يجب أن تكون السمة: ملفًا من النوع: القيم.',
  'min' =>
  array (
    'array' => 'يجب أن تحتوي السمة: على الأقل على: اقل من العناصر.',
    'file' => 'يجب أن تكون السمة: على الأقل: دقيقة كيلوبايت.',
    'numeric' => 'يجب أن تكون السمة: اقل.',
    'string' => 'يجب ألا تقل السمة: عن: اقل حرفًا.',
  ),
  'not_in' => 'السمة المحددة: غير صالحة.',
  'not_regex' => 'تنسيق السمة: غير صالح.',
  'numeric' => 'يجب أن تكون السمة رقمًا.',
  'password' => 'كلمة المرور غير صحيحة.',
  'present' => 'يجب أن يكون حقل السمة موجودًا.',
  'regex' => 'تنسيق السمة: غير صالح.',
  'required' => ': حقل السمة مطلوب.',
  'required_if' => 'يكون حقل السمة مطلوبًا عندما: الآخر هو: القيمة.',
  'required_unless' => 'حقل السمة مطلوب إلا إذا كان الآخر في: قيم.',
  'required_with' => 'يكون حقل السمة مطلوبًا عندما تكون: القيم موجودة.',
  'required_with_all' => 'يكون حقل السمة مطلوبًا عندما تكون: القيم موجودة.',
  'required_without' => 'يكون حقل السمة مطلوبًا عندما: القيم غير موجودة.',
  'required_without_all' => 'يكون حقل السمة مطلوبًا في حالة عدم وجود أي من قيم:.',
  'same' => 'يجب أن تكون السمة: الحجم.',
  'size' =>
  array (
    'array' => 'يجب أن تحتوي السمة: على عناصر الحجم.',
    'file' => 'يجب أن تكون السمة: الحجم كيلوبايت.',
    'numeric' => 'يجب أن تكون السمة: الحجم.',
    'string' => 'يجب أن تكون السمة: حجم الأحرف.',
  ),
  'starts_with' => 'يجب أن تبدأ السمة: بأحد القيم التالية:',
  'string' => 'يجب أن تكون السمة: سلسلة.',
  'timezone' => 'يجب أن تكون السمة: منطقة صالحة.',
  'unique' => 'تم استخدام الاسم : بالفعل.',
  'uploaded' => 'فشل تحميل السمة:.',
  'url' => 'تنسيق السمة: غير صالح.',
  'uuid' => 'يجب أن تكون السمة: UUID صالحًا.',
);
