<?php

return array (
  'accepted' => 'يجب قبول :.',
  'active_url' => ': ليست عنوان URL صالحًا.',
  'after' => 'يجب أن تكون  تاريخًا بعد: التاريخ.',
  'after_or_equal' => 'يجب أن تكون  تاريخًا بعد: التاريخ أو مساويًا له.',
  'alpha' => 'لا يجوز أن تحتوي : إلا على أحرف.',
  'alpha_dash' => 'لا يجوز أن تحتوي : إلا على أحرف وأرقام وشرطات وشرطات سفلية.',
  'alpha_num' => 'لا يجوز أن تحتوي : إلا على أحرف وأرقام.',
  'array' => 'يجب أن تكون  مصفوفة.',
  'attributes' =>
  array (
  ),
  'before' => 'يجب أن تكون  تاريخًا قبل: التاريخ.',
  'before_or_equal' => 'يجب أن تكون  تاريخًا يسبق: التاريخ أو مساويًا له.',
  'between' =>
  array (
    'array' => 'يجب أن تحتوي : على ما بين: اقل و: اكثر من العناصر.',
    'file' => 'يجب أن تكون : بين: اقل و: اكثر كيلوبايت.',
    'numeric' => 'يجب أن تكون : بين: اقل  و: اكثر .',
    'string' => 'يجب أن تكون : بين: اقل و: اكثر حرفًا.',
  ),
  'boolean' => 'يجب أن يكون الحقل : صح أو خطأ.',
  'confirmed' => 'تأكيد  غير متطابق.',
  'custom' =>
  array (
    'attribute-name' =>
    array (
      'rule-name' => 'رسالة مخصصة',
    ),
  ),
  'date' => ': ليست تاريخًا صالحًا.',
  'date_equals' => 'يجب أن تكون  تاريخًا مساويًا لـ: التاريخ.',
  'date_format' => ': لا تطابق التنسيق: صيغة.',
  'different' => 'يجب أن يكون:  و: الآخر مختلفين.',
  'digits' => 'يجب أن تكون : أرقامًا وأرقامًا.',
  'digits_between' => 'يجب أن تكون : بين: اقل و: اكثر أرقام.',
  'dimensions' => ' لها أبعاد صورة غير صالحة.',
  'distinct' => 'يحتوي الحقل  على قيمة مكررة.',
  'email' => 'يجب أن تكون  عنوان بريد إلكتروني صالحًا.',
  'ends_with' => 'يجب أن تنتهي : بأحد القيم التالية:',
  'exists' => ' المحددة: غير صالحة.',
  'file' => 'يجب أن تكون : ملفًا.',
  'filled' => 'يجب أن يحتوي الحقل  على قيمة.',
  'gt' =>
  array (
    'array' => 'يجب أن تحتوي : على أكثر من: عناصر القيمة.',
    'file' => 'يجب أن تكون : أكبر من: القيمة كيلوبايت.',
    'numeric' => 'يجب أن تكون : أكبر من: القيمة.',
    'string' => 'يجب أن تكون : أكبر من: أحرف القيمة.',
  ),
  'gte' =>
  array (
    'array' => 'يجب أن تحتوي : على عناصر قيمة أو أكثر.',
    'file' => 'يجب أن تكون : أكبر من أو تساوي: القيمة كيلوبايت.',
    'numeric' => 'يجب أن تكون : أكبر من أو تساوي: القيمة.',
    'string' => 'يجب أن تكون : أكبر من أو تساوي: أحرف القيمة.',
  ),
  'image' => 'يجب أن تكون  صورة.',
  'in' => ' المحددة: غير صالحة.',
  'in_array' => 'الحقل : غير موجود في: أخرى.',
  'integer' => 'يجب أن تكون  عددًا صحيحًا.',
  'ip' => 'يجب أن تكون : عنوان IP صالحًا.',
  'ipv4' => 'يجب أن تكون : عنوان IPv4 صالحًا.',
  'ipv6' => 'يجب أن تكون  عنوان IPv6 صالحًا.',
  'json' => 'يجب أن تكون : سلسلة JSON صالحة.',
  'lt' =>
  array (
    'array' => 'يجب أن تحتوي  على أقل من: عناصر القيمة.',
    'file' => 'يجب أن تكون : أقل من: قيمة كيلوبايت.',
    'numeric' => 'يجب أن تكون : أقل من: القيمة.',
    'string' => 'يجب أن تكون : أقل من: أحرف القيمة.',
  ),
  'lte' =>
  array (
    'array' => 'يجب ألا تحتوي : على أكثر من: عناصر القيمة.',
    'file' => 'يجب أن تكون : أقل من أو تساوي: قيمة كيلوبايت.',
    'numeric' => 'يجب أن تكون : أقل من أو تساوي: القيمة.',
    'string' => 'يجب أن تكون : أقل من أو تساوي: أحرف القيمة.',
  ),
  'max' =>
  array (
    'array' => 'لا يجوز أن تحتوي : على أكثر من: الحد الأقصى من العناصر.',
    'file' => 'لا يجوز أن تكون : أكبر من: اكثر كيلوبايت.',
    'numeric' => 'لا يجوز أن تكون : أكبر من: اكثر.',
    'string' => 'لا يجوز أن تكون : أكبر من: الحد الأقصى من الأحرف.',
  ),
  'mimes' => 'يجب أن تكون : ملفًا من النوع: القيم.',
  'mimetypes' => 'يجب أن تكون : ملفًا من النوع: القيم.',
  'min' =>
  array (
    'array' => 'يجب أن تحتوي : على الأقل على: اقل من العناصر.',
    'file' => 'يجب أن تكون : على الأقل: دقيقة كيلوبايت.',
    'numeric' => 'يجب أن تكون : اقل.',
    'string' => 'يجب ألا تقل : عن: اقل حرفًا.',
  ),
  'not_in' => ' المحددة: غير صالحة.',
  'not_regex' => 'تنسيق : غير صالح.',
  'numeric' => 'يجب أن تكون  رقمًا.',
  'password' => 'كلمة المرور غير صحيحة.',
  'present' => 'يجب أن يكون الحقل  موجودًا.',
  'regex' => 'تنسيق : غير صالح.',
  'required' => 'الحقل  مطلوب.',
  'required_if' => 'يكون الحقل  مطلوبًا عندما: الآخر هو: القيمة.',
  'required_unless' => 'الحقل  مطلوب إلا إذا كان الآخر في: قيم.',
  'required_with' => 'يكون الحقل  مطلوبًا عندما تكون: القيم موجودة.',
  'required_with_all' => 'يكون الحقل  مطلوبًا عندما تكون: القيم موجودة.',
  'required_without' => 'يكون الحقل  مطلوبًا عندما: القيم غير موجودة.',
  'required_without_all' => 'يكون الحقل  مطلوبًا في حالة عدم وجود أي من قيم:.',
  'same' => 'يجب أن تكون : الحجم.',
  'size' =>
  array (
    'array' => 'يجب أن تحتوي : على عناصر الحجم.',
    'file' => 'يجب أن تكون : الحجم كيلوبايت.',
    'numeric' => 'يجب أن تكون : الحجم.',
    'string' => 'يجب أن تكون : حجم الأحرف.',
  ),
  'starts_with' => 'يجب أن تبدأ : بأحد القيم التالية:',
  'string' => 'يجب أن تكون : سلسلة.',
  'timezone' => 'يجب أن تكون : منطقة صالحة.',
  'unique' => 'تم استخدام الاسم : بالفعل.',
  'uploaded' => 'فشل تحميل :.',
  'url' => 'تنسيق : غير صالح.',
  'uuid' => 'يجب أن تكون : UUID صالحًا.',
);
